БИТУправление_медицинским_центром_демо/src/InformationRegisters/МагнитныеКарты/МагнитныеКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МагнитныеКарты</name>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.Клиенты</types>
      <types>CatalogRef.Сертификаты</types>
      <types>CatalogRef.КартыСкидок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/МагнитныеКарты/RecordSetModule.bsl
#Область РазделОписанияПеременных
Перем мНеРазрешитьНеуникальныеКоды;
#КонецОбласти

#Область ОбработчикиСобытий
// Обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если мНеРазрешитьНеуникальныеКоды Тогда
		Для Каждого ТекущаяЗапись Из ЭтотОбъект Цикл
			Если ЗначениеЗаполнено(ТекущаяЗапись.КодКарты) Тогда
				Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
				                      |	МагнитныеКарты.Владелец КАК Владелец,
				                      |	МагнитныеКарты.КодКарты
				                      |ИЗ
				                      |	РегистрСведений.МагнитныеКарты КАК МагнитныеКарты
				                      |ГДЕ
				                      |	МагнитныеКарты.КодКарты = &КодКарты");
				
				Запрос.УстановитьПараметр("КодКарты", ТекущаяЗапись.КодКарты);
				
				РезультатЗапроса = Запрос.Выполнить();
				Если Не РезультатЗапроса.Пустой() Тогда
					Выборка = РезультатЗапроса.Выбрать();
					Выборка.Следующий();
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Магнитная карта с кодом: " + Выборка.КодКарты + " уже имеет владельца """ + СокрЛП(Выборка.Владелец) + """.");
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()
#КонецОбласти

#Область РазделИнициализации
мНеРазрешитьНеуникальныеКоды = Истина;
#КонецОбласти
